# Ultralytics YOLO 🚀, GPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 10  # number of classes
depth_multiple: 0.67  # scales module repeats
width_multiple: 0.75 # scales convolution channelsa
 
# YOLOv8.0n backboneq
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2

  - [-1, 3, C2f, [64, True]]
  
  - [-1, 6, C2f, [64, True]]   #2
  - [-1, 1, Conv, [128, 3, 2]] 

  - [-1, 6, C2f, [128, True]]    #4 
 
  - [-1, 3, C2f, [96, True]]   #5

  - [-1, 1, SPPF, [96, 5]]  # 6

# YOLOv8.0n head
head:
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [128]]  # 8

  - [[-1, 3], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [128]]  # 10 (P3/8-small)
  
  - [[-1, 8], 1, Concat, [1]]  # cat head P4 
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 3, C2f, [256]]  # 13 (P4/16-medium)q

  - [6, 1, Conv, [192, 3, 2]]
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 1, Conv, [448, 3, 2]]
  - [-1, 3, C2f, [448]]  # 17 (P5/32-large)

  - [[10, 13, 17], 1, Detect, [nc]]  # Detect(P3, P4, P5)